dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEmem_mpu_bf.h
/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN49 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN49_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN49 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN49_OFF (17u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN50 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN50_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN50 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN50_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN50 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN50_OFF (18u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN51 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN51_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN51 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN51_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN51 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN51_OFF (19u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN52 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN52_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN52 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN52_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN52 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN52_OFF (20u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN53 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN53_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN53 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN53_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN53 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN53_OFF (21u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN54 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN54_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN54 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN54_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN54 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN54_OFF (22u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN55 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN55_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN55 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN55_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN55 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN55_OFF (23u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN56_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN56_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN56 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN56_OFF (24u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN57_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN57_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN57 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN57_OFF (25u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN58_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN58_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN58 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN58_OFF (26u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN59_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN59_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN59 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN59_OFF (27u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN60_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN60_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN60 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN60_OFF (28u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN61_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN61_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN61 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN61_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN62_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN62_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN62 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN62_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN63_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN63_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRB_EN63_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEMEM_MPU_BF_H */
